Приложение/Documents/НачислениеРейтинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>НачислениеРейтинга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРейтинга</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПовышенияРейтинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПовышениеРейтинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Приложение/InformationRegisters/Telegram_Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Telegram_Пользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDПользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Приложение/Documents/НачислениеРейтинга/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПричинаПовышенияРейтингаПриИзмененииНаСервере()
	Объект.Рейтинг =Объект.ПричинаПовышенияРейтинга.Стоимость;
	Элементы.Рейтинг.Доступность = Ложь;   
	Элементы.Комментарий.Видимость = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ПричинаПовышенияРейтингаПриИзменении(Элемент)
	ПричинаПовышенияРейтингаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура РучнойВводРейтингаПриИзмененииНаСервере()
	Элементы.Рейтинг.Доступность = Истина;
	Объект.Рейтинг = 0; 
	Объект.ПричинаПовышенияРейтинга = "";  
	Элементы.Комментарий.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РучнойВводРейтингаПриИзменении(Элемент)
	РучнойВводРейтингаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеРейтинга.Студент.Телефон КАК СтудентТелефон,
		|	Telegram_Пользователи.Телефон КАК Телефон,
		|	Telegram_Пользователи.IDПользователя КАК IDПользователя
		|ИЗ
		|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеРейтинга КАК НачислениеРейтинга
		|		ПО Telegram_Пользователи.Телефон = НачислениеРейтинга.Студент.Телефон
		|ГДЕ
		|	НачислениеРейтинга.Студент = &Студент"; 
	
	Запрос.УстановитьПараметр("Студент",Объект.Студент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 АйдиПользователя = ВыборкаДетальныеЗаписи.IDПользователя;
	КонецЦикла;


	ТекстСообщения = "";
	Если РучнойВводРейтинга = Истина Тогда
	ТекстСообщения = ТекстСообщения+ "Вам было добавлено: " + Объект.Рейтинг+ " рейтинга" + Символы.ПС+"По причине: "+Объект.Комментарий+" CAADBQADiQMAAukKyAPZH7wCI2BwFxYE";

	Иначе
	ТекстСообщения = ТекстСообщения+ "Вам было добавлено: " + Объект.Рейтинг+ " рейтинга" + Символы.ПС+"По причине: "+Объект.ПричинаПовышенияРейтинга;
	
	
	КонецЕсли;
		Telegram_Сервер.ОтправитьСообщение(АйдиПользователя,ТекстСообщения);
КонецПроцедуры
